/*
 * Тестовая программа для проверки процедур записи и чтения в устройство FLASH-памяти SPI AT25DF161-SH-T
 * 
 */

//-----------------------------------------------------------------------
// ПОДКЛЮЧЕНИЕ БИБЛИОТЕК
//-----------------------------------------------------------------------
#include <SPI.h>
#include "define.h"
#include "sGlobal.h"
#include "sTime.h"
#include "sAddress.h"
#include "sStatus.h"
#include "cFlash.h"
#include "cIncoming.h"

//-----------------------------------------------------------------------
// КОНСТАНТЫ
//-----------------------------------------------------------------------

#define ADDR1 1
#define ADDR2 0
#define ADDR3 0

//-----------------------------------------------------------------------
// КЛАССЫ И СТРУКТУРЫ
//-----------------------------------------------------------------------


//-----------------------------------------------------------------------
// ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
//-----------------------------------------------------------------------
cFlash sGlobal::Flash;
cIncoming Incoming;

SPISettings sStatus::mySet(100000, MSBFIRST, SPI_MODE0);//Установка режима работы SPI

//-----------------------------------------------------------------------
// Программа начальной установки
//-----------------------------------------------------------------------
void setup() 
{
  Serial.begin(115200);
  
  sGlobal::Flash.install(SSPin);   //Инициализация конфигурации микросхемы памяти
  SPI.begin();            //Инициализация SPI

  // Инициализация массива для записи
  for(int i = 0; i <256; i++) sGlobal::Flash.data[i] = i;

}//End of void setup()

//-----------------------------------------------------------------------
// Главный программный цикл
//-----------------------------------------------------------------------
void loop() {
  
  Incoming.operate();
  Incoming.execute();
  
}//End of void loop()

//-----------------------------------------------------------------------
// Подпрограммы
//-----------------------------------------------------------------------

